# IConnector Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IConnector Interface
Members See Also
---
An interface which provides access to connector in Autodesk Revit MEP document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IConnector
```

Visual Basic
---
```text
Public Interface IConnector
```

Visual C++
---
```text
public interface class IConnector
```

# Remarks
This interface is shared by Connector, ConnectorElement.
# See Also
IConnector Members
Autodesk.Revit.DB Namespace